# vstSetDataLong

## Description
```pascal
PROCEDURE vstSetDataLong(
				inDataID   : LONGINT;
				inDataVal  : LONGINT;
				VAR result : BOOLEAN);
```

```python

def vs.vstSetDataLong(inDataID, inDataVal):
    return result
```

## Parameters
|Name|Type|Description|
|---|---|---|
|inDataID|LONGINT||
|inDataVal|LONGINT||
|result|BOOLEAN||

## Version
Availability: from Vectorworks 2011
## Category
* Tool Events